Revit 2026 API
LineLoad.SetCurve Method
 Sets the curve for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetCurve(
	Curve curve
)
Public Sub SetCurve (
	curve As Curve
)
public:
void SetCurve(
	Curve^ curve
)
member SetCurve :
        curve : Curve -> unit
Parameters
curve Curve
Exceptions
Exception | Condition
ArgumentException |  The input curve is not bound. -or- The provided curve is not supported.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This LineLoad is not a hosted load. -or- This LineLoad is a constrained load.
Remarks
 The curve must be bounded. The curve can be:
Line
Arc
Ellipse
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace